package main

import (
	"fmt"
	"sync"
)

// time.Sleep использовать нельзя. это будет не валидным ответом на собеседовании
// Расскажи подробно что происходит
//	- Падаем с ошибкой, так как wg ждет других гороути, а они блокируются на записи, то есть ждут пока их данные прочитают
// Как сделать так, чтобы работало оставив канал небуферезированным?

func main() {
	ch := make(chan int)
	wg := &sync.WaitGroup{}

	wg.Add(3)
	for i := 0; i < 3; i++ {
		go func(v int) {
			defer wg.Done()

			ch <- v * v
		}(i)
	}

	go func() { // просто добавим еще одну горутину которая закроет канал, для цикла
		wg.Wait()
		close(ch)
	}()

	//	Позволим основной горутине читать данные

	var sum int
	for v := range ch {
		sum += v
	}
	fmt.Printf("result: %d\n", sum)
}
